# Pandas(Panel Datas)

##### Pandas package import

In [1]:
import pandas as pd

### Series class

#### Series 생성하기  
-pandas.Serise
```python
class pandas.Seies(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)
```

In [7]:
series = pd.Series(["하나","둘","셋","넷","다섯",
                    "여섯","일곱","여덟","아홉","열"],
                   index = [_ for _ in range(1,11)])
series

1     하나
2      둘
3      셋
4      넷
5     다섯
6     여섯
7     일곱
8     여덟
9     아홉
10     열
dtype: object

In [10]:
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [12]:
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

In [13]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [14]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [15]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [19]:
d = {'a': 1,'b': 2,'c': 3}
ser = pd.Series(data=d, index=['a','b','c'])
ser

a    1
b    2
c    3
dtype: int64

In [21]:
d = {'a': 1,'b': 2,'c': 3}
ser = pd.Series(data=d, index=['x','y','z'])
ser # NaN 값이 float자료형에서만 표현이 가능하므로 결과가 float자료형이 되었다.

x   NaN
y   NaN
z   NaN
dtype: float64

In [22]:
s2 = pd.Series({"서울":9_904_312,
                "부산":3_448_737,
                "인천":2_890_451,
                "대구":2_466_052})
s2

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

#### Series index를 속성처럼 활용하기

In [23]:
d = {'a':1,'b':2,'c':3}
ser = pd.Series(data=d,index=['a','b','c'])
ser

a    1
b    2
c    3
dtype: int64

In [24]:
ser.a, ser.b, ser.c

(1, 2, 3)

#### Series의 특징

In [25]:
"서울" in s # 인덱스 레이블 중에 서울이 있는가

True

In [26]:
"대전" in s # 인덱스 레이블 중에 대전이 있는가

False

In [27]:
for k, v in s.items():
    print(f"{k}, {v}")

서울, 9904312
부산, 3448737
인천, 2890451
대구, 2466052

#### Series 연산하기

In [31]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [30]:
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

#### Series 인덱싱

In [32]:
s[1], s["부산"]

(3448737, 3448737)

In [35]:
s[3], s["대구"]

(2466052, 2466052)

In [39]:
s[[0,3,1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [40]:
s[["서울", "대구", "부산"]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

#### Series 슬라이싱

In [43]:
s[1:3] # 두번째 (1)부터 세번째 (2)까지 (네번째(3) 미포함)

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [44]:
s["부산":"대구"] # 부산에서 대구까지 (대구도 포함)

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

#### Series index 기반 연산

In [45]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [46]:
s2 = pd.Series({"서울": 9631482,"부산":3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [47]:
ds = s -s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

#### Series에서 값이 NaN인지 확인

In [48]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

#### Series에서 NaN이 아닌 값 구하기

In [50]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [51]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [52]:
s # 2015년 도시별 인구

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [53]:
s2 # 2010년 도시별 인구

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [54]:
rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

#### Series 데이터 추가, 갱신, 삭제

In [56]:
rs # 인구 증가율(%)

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [60]:
rs["부산"] = 1.63 # 갱신
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [61]:
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [63]:
rs["대구"] = 1.41 # 추가
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [64]:
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [65]:
del rs["서울"]
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

#### Series class 연습문제

#### 아래 fin1과  fin2_value, fin2_index를 활용하여  
Series 객체 ser_finance1, ser_finaance2를 만들어 보세요.  
fin1 = {"카카오":60010, "삼성전자":61000,"LG전자":90000}  
fin2_value = [60200,61200,200100]  
fin2_index = ["카카오", "삼성전자", "네이버"]

In [84]:
fin1 = {"카카오":60010,"삼성전자":61000,"LG전자":90000}
fin2_value = [60200,61200,200100]
fin2_index = ["카카오", "삼성전자", "네이버"]
ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value,fin2_index)

#### 앞서 만든 두 Series 객체를 활용하여 사칙 연산을 각각 수행해보세요.  
사칙연산 중 NaN 값을 갖는 항목과 dtype을 각각 확인해보세요.  
왜 해당 dtype이 나오는지 설명하세요.

In [85]:
ser_finance1 - ser_finance2

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

In [86]:
ser_finance1 + ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

In [87]:
ser_finance1 * ser_finance2

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

In [88]:
ser_finance1 / ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

#### 아래의 연산 결과 중 NaN 값이 없게 Series 객체를 출력해보세요.  
```python
result = ser_finance1 - ser_finance2
```

In [93]:
result = ser_finance1 - ser_finance2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

### DataFrame class

#### pandas.DataFrame
```python
class pandas.DataFrame(data=None, index=None, column=None, dtype=None, copy=None)
```

#### DataFrame 생성하기

- 우선 하나의 열이 되는 데이터를 리스트나 일차원 배열을 준비합니다.
- 이 각각의 열에 대한 이름을 키로 가지는 딕셔너리를 만듭니다.
- 이 데이터를 DataFrame 클래스 생성자에 넣는다.  
동시에 열방향 index는 columns인수로, 행방향 index는 index 인수로 지정합니다

In [389]:
d = {'col1': [1,2], 'col2':[3,4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [390]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762564, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경산권", "수도권", "경상권"],
    "2010-2015 증가율" : [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762564  9853972         0.0283
부산  경산권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

#### DataFrame의 속성 values, columns, index

In [391]:
df.values

array([['수도권', 9904312, 9631482, 9762564, 9853972, 0.0283],
       ['경산권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [392]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [393]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

#### DataFrame에 이름 붙이기

In [394]:
df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762564  9853972         0.0283
부산  경산권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

#### DataFeame 전치

In [395]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경산권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762564  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

#### DataFrame column 추가, 갱신, 삭제

In [396]:
# "2010-2015 증가율"이라는 이름의 열의 값을 갱신
df["2010-2015 증가율"] = df["2010-2015 증가율"] *100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762564  9853972           2.83
부산  경산권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [397]:
# "2005-2010 증가율"이라는 이름의 열 추가
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762564  9853972           2.83          -1.34
부산  경산권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [398]:
# "2010-2015 증가율"이라는 이름의 열 삭제
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762564  9853972          -1.34
부산  경산권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

#### DataFrame column 인덱싱

In [399]:
# 하나의 column만 인덱싱 하면 Series가 반환된다.
df["지역"]

도시
서울    수도권
부산    경산권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [400]:
# 2010이라는 column을 반환하면서 Series 자료형으로 변환
df["2010"]

도시
서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [401]:
type(df["2010"])

pandas.core.series.Series

In [402]:
# 여러 개의 column을 인덱싱하면 부분적인 DataFrame이 반환된다.
df[["2010","2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [403]:
# 2010이라는 column을 반환하면서 DataFrame 자료형을 유지
df[["2010"]]

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [404]:
# column index가 문자열 label일 때 는 순서를 나타내는 정수 index를 column 인덱싱에 사용할 수 없습니다.
df[0]

KeyError: 0

In [405]:
import numpy as np
df2 = pd.DataFrame(np.arange(12).reshape(3,4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [406]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int32

In [407]:
df2[[1,2]]

   1   2
0  1   2
1  5   6
2  9  10

#### DataFrame row 슬라이싱

In [408]:
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762564  9853972          -1.34
부산  경산권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [409]:
df[:1] # df[:"서울"] --> 문자는 포함, 숫자는 미포함

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762564  9853972          -1.34

In [410]:
df[1:2]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경산권  3448737  3393191  3512547  3655437           -3.4

In [411]:
df["부산":"부산"]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경산권  3448737  3393191  3512547  3655437           -3.4

#### DataFrame row를 인덱실 할 경우

In [412]:
df["서울"]

KeyError: '서울'

#### DataFrame 개별 데이터 인덱싱

In [413]:
df["2015"]["서울"]

9904312

In [414]:
type(df["2015"]["서울"])

numpy.int64

#### DataFrame 개별 데이터 인덱싱, 역순은 안 될까?

In [415]:
df["서울":"서울"]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762564  9853972          -1.34

In [416]:
df["서울":"서울"]["2015"] # 효율적이지 않음

도시
서울    9904312
Name: 2015, dtype: int64

In [417]:
type(df["서울":"서울"]["2015"])

pandas.core.series.Series

#### DataFrame 연습문제

##### 지금부터 인터넷 서핑을 통해 자신이 관심있는 데이터를 얻고,
아래 조건을 만족하는 DataFrame을 직점 만들어보세요!
- column의 개수와 row의 개수가 각각 4개 이상이어야 합니다.
- column에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 합니다.

In [118]:
data = {
    "2019" : [985, 983, 936, 898, 898],
    "2020" : [995, 990, 960, 910, 910],
    "2021" : [1020, 1018, 972, 926, 925],
    "2022" : [1041, 1040, 992, 956, 955],
    "2023" : [1072, 1071, 1023,987 ,986],
    "지역": ["수도권","수도권","수도권","경상권","경상권"],
}
columns = ["지역","2019","2020","2021","2022","2023"]
index = ["도쿄","가나가와","오사카","사이타마","아이지"]
minimum_wage = pd.DataFrame(data, index=index, columns=columns)
minimum_wage.T

        도쿄  가나가와   오사카 사이타마  아이지
지역     수도권   수도권   수도권  경상권  경상권
2019   985   983   936  898  898
2020   995   990   960  910  910
2021  1020  1018   972  926  925
2022  1041  1040   992  956  955
2023  1072  1071  1023  987  986

##### 다음 DataFrame을 활용하여 아래 문제를 해결해보세요.
- 모든 학생의 수학 점수를 Series로 나타낸다.
- 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
- 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
- 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
- 춘향의 점수를 DataFrame으로 나타낸다.
- 향단의 점수를 Series로 나타낸다.  
```python
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
```

In [317]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [331]:
df["수학"]
df[["국어","영어"]]
df["평균 점수"] = ((df["국어"] + df["영어"] + df["수학"]) / 3).round()
df["영어"]["방자"] = 80
df["평균 점수"] = ((df["국어"] + df["영어"] + df["수학"]) / 3).round()
df[:1]
df.T["향단"]
df

C:\Users\Playdata\AppData\Local\Temp\ipykernel_10072\1164272044.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["영어"]["방자"] = 80

    국어  영어  수학  평균 점수
춘향  80  90  90   87.0
몽룡  90  70  60   73.0
향단  70  60  80   70.0
방자  30  80  70   60.0

##### 다음 DataFrame을 만들어보세요.
- 랜덤 시드는 0입니다.
- values는 넘파이 서브 패키지 중 random의 randn() 메서드를 사용하세요.
- pd.date_range("20130206", periods=날짜수)을 활용하세요.

In [418]:
np.random.seed(0)
dates = pd.date_range("20130226", periods=6)
df3 = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df3

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165

# class 복습문제

#### 팀 객체를 생성할 수 있는 클래스를 만들어보세요.
- 클래스 속성 : count(default 0), order (default 빈리스트)
- 인스턴스 속성 : number(필수), name(default None)
- 비공개 인스턴스 속성 : member (default 빈 set)

In [900]:
class Team:
    """팀 객체를 만듭니다."""
    count = 0
    order = []
    
    def __init__(self,number,name=None,member=set()):
        self.number = number
        self.name = name
        self.__member = member
        Team.count += 1
        
    def add_member(self,name):
        if name in self.__member:
            print(f'{name} 님은 이미 팀에 있습니다.')
        else:
            self.__member.add(name)
            print(f'{name} 님을 {self.number} 팀에 추가했습니다.')
    
    def rm_member(self,name):
        if name in self.__member:
            self.__member.discard(name)
            print(f'{name} 님을 {self.number} 팀에서 삭제했습니다.')
        else:
            print(f'{name} 님은 해당팀에 없습니다.')
    
    def get_count(self):
        return self.count
    
    def get_order(self):
        return self.order
    
    def set_order(self,number):
        if number in self.order:
            self.order.remove(number)
        self.order.append(number)
        
    def __len__(self):
        return len(self.__member)

In [901]:
t1 = Team(1)

In [902]:
t1.add_member("윤규헌")

윤규헌 님을 1 팀에 추가했습니다.

In [903]:
t1.add_member("윤규헌")

윤규헌 님은 이미 팀에 있습니다.

In [904]:
print(len(t1))

1

In [905]:
t1.add_member('이호진')

이호진 님을 1 팀에 추가했습니다.

In [906]:
print(len(t1))

2

In [907]:
t1.add_member("이기수")

이기수 님을 1 팀에 추가했습니다.

In [908]:
t1.rm_member('이기수')

이기수 님을 1 팀에서 삭제했습니다.

In [909]:
t1.rm_member('이기수')

이기수 님은 해당팀에 없습니다.

In [910]:
t2 = Team(2)

In [911]:
t2.set_order(t2.number)

In [912]:
t1.set_order(t1.number)

In [913]:
t1.get_order()

[2, 1]

In [914]:
t1.get_count()

2

In [915]:
t3 = Team(3)

In [916]:
t3.get_count()

3

In [917]:
t3.set_order(t3.number)

In [918]:
t3.get_order()

[2, 1, 3]

In [921]:
class Team:
    """팀 객체를 만듭니다."""
    # 클래스 속성
    count = 0 # Team 클래스로부터 초기화된 인스턴스 개수
    order = []
    
    def __init__(self,number,name=None,member=set()):
        self.number = number
        self.name = name
        self.member = member
        Team.count += 1
        
    def add_member(self,name):
        # 해당 이름이 팀에 있을 경우
        if name in self.__member:
            print(f'{name} 님은 이미 팀에 있습니다.')
            return
        # 해당 이름이 팀에 없을 경우
        else:
            self.__member.add(name)
            print(f'{name} 님을 {self.number} 팀에 추가했습니다.')
            
    def rm_member(self,name):
        if name in self.__member:
            self.__member.discard(name)
            print(f'{name} 님을 {self.number} 팀에서 삭제했습니다.')
        else:
            print(f'{name} 님은 해당팀에 없습니다.')
    
    def get_count(self):
        return self.count
    
    def get_order(self):
        return self.order
    
    def set_order(self,number):
        if number in self.order:
            self.order.remove(number)
        self.order.append(number)
        
    # 내장 함수(Built-in function) len(Team()) --> 파이썬이 __len__(self)를 찾아서 실행
    def __len__(self):
        return len(self.__member)

In [920]:
t1 = Team(1) # Team 클래스로부터 인스턴스를 초기화한다. 초기화 할 때 넣는 인자 값은 __init__(self, 여기로 전달됨)  
# 초기화될 때 1번이자 ㅊ최초로 실행되는게  __init__(self) 이 특별 메서드이다.